<a href="https://colab.research.google.com/github/DebjitHore/PadhAI_FDS/blob/master/Pandas(continued)_PadhAI_Week10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [56]:
import numpy as np
import pandas as pd

In [57]:
df= pd.DataFrame(np.random.randint(0,10,(5,3)))
df

   0  1  2
0  3  0  5
1  9  5  4
2  4  6  9
3  4  6  9
4  3  9  7

In [58]:
df=df.rename(index= {0:'R1', 1:'R2', 2:'R3', 3:'R4', 4:'R5'},columns = {0:'C1', 1:'C2', 2:'C3'})
#Alternative df.index= ['R1', ....'R5'] 
#df.columns = ['C1'....'C3']

In [59]:
df.loc['R3', 'C2']

6

In [60]:
df.iloc[2,1]

6

In [61]:
df.iloc[2:4, 1:3]

    C2  C3
R3   6   9
R4   6   9

In [62]:
df.loc['R3':'R5', 'C2':'C3']

    C2  C3
R3   6   9
R4   6   9
R5   9   7

In [63]:
df.iloc[0] #A series object containing all the first row elements is returned

C1    3
C2    0
C3    5
Name: R1, dtype: int64

In [64]:
df.iloc[:,0]

R1    3
R2    9
R3    4
R4    4
R5    3
Name: C1, dtype: int64

In [65]:
df.T

    R1  R2  R3  R4  R5
C1   3   9   4   4   3
C2   0   5   6   6   9
C3   5   4   9   9   7

In [66]:
def create_df(nRows, nCols, maxValue):
  arr= np.random.randint(0, maxValue, (nRows, nCols))
  df=pd.DataFrame(arr)
  df.index= ['R'+ str(x) for x in np.arange(1, nRows+1)]
  df.columns= ['C'+ str(x) for x in np.arange(1, nCols+1)]
  return df

In [67]:
create_df(5,3, 15)

    C1  C2  C3
R1  12   5   6
R2   1   7  11
R3   0   6   7
R4  13   5   0
R5   1  10   8

In [68]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
print(mass, diameter)
np.mean(mass)

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64 Mercury      4879
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

296.29184444444445

In [69]:
df= pd.DataFrame({
    'Mass': mass,
    'Diameter':diameter
})
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [70]:
df.loc['Earth', 'Mass']

5.97

In [71]:
df['Population']= 0 
#lambda x: x=10e9 if df.index=='Earth' else x=0

In [72]:
df.loc['Earth', 'Population']= 8*10e9
df

              Mass  Diameter   Population
Earth       5.9700     12756  80000000000
Jupiter  1898.0000    142984            0
Mars        0.6420      6792            0
Mercury     0.3300      4879            0
Moon           NaN      3475            0
Neptune   102.0000     49528            0
Pluto       0.0146      2370            0
Saturn    568.0000    120536            0
Uranus     86.8000     51118            0
Venus       4.8700     12104            0

In [73]:
df.loc['Column Mean']=0
#df=df.drop('Moon') 
np.mean(df['Mass'])

266.66266

In [74]:
def create_meanrow(df):
  #mean_mass= np.mean(df.loc[:, 'Mass'])
  #mean_dia= np.mean(df.loc[:, 'Diameter'])
  #mean_pop= np.mean(df.loc[:, 'Population'])
  #df.loc['Column Mean']= [mean_mass, mean_dia, mean_pop]
  #df.loc['Column Mean']= [np.mean(df[col] for col in df.columns)]
  df.loc['Column Mean']= df.mean()
  return df

In [75]:
create_meanrow(df)

                   Mass       Diameter    Population
Earth           5.97000   12756.000000  8.000000e+10
Jupiter      1898.00000  142984.000000  0.000000e+00
Mars            0.64200    6792.000000  0.000000e+00
Mercury         0.33000    4879.000000  0.000000e+00
Moon                NaN    3475.000000  0.000000e+00
Neptune       102.00000   49528.000000  0.000000e+00
Pluto           0.01460    2370.000000  0.000000e+00
Saturn        568.00000  120536.000000  0.000000e+00
Uranus         86.80000   51118.000000  0.000000e+00
Venus           4.87000   12104.000000  0.000000e+00
Column Mean   266.66266   36958.363636  7.272727e+09

In [76]:
df.describe()

              Mass       Diameter    Population
count    10.000000      11.000000  1.100000e+01
mean    293.328926   40318.214876  7.933884e+09
std     591.956878   48909.153260  2.400100e+10
min       0.014600    2370.000000  0.000000e+00
25%       1.699000    5835.500000  0.000000e+00
50%      46.385000   12756.000000  0.000000e+00
75%     225.496995   50323.000000  0.000000e+00
max    1898.000000  142984.000000  8.000000e+10

In [77]:
import seaborn as sns

In [78]:
planets= sns.load_dataset('planets')
planets.shape

(1035, 6)

In [79]:
type(planets)

pandas.core.frame.DataFrame

In [80]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [81]:
planets.head(5)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [82]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

#Tasks
1.Go through each row and delete if NaN value is present in any of the columns

In [83]:
for r in planets.index:
  for c in planets.columns:
    if pd.isnull(planets.loc[r,c]):
      planets.drop(r, inplace=True)
      break

In [84]:
planets.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [85]:
#Alternate way of doing it with iterrows
#for i, r in planets.iterrows():     r returns the entire i-th row as a series slice and then we check if there are any NaN values in that series object
  #if pd.isnull(r).any():
    #planets.drop(i, inplace=True)

In [86]:
#Alternative 2
#planets.dropna(inplace=True)

#Querying a database

Filter and show only those rows which have planets that are found in 2010s and method is 'Radial Velocity' and 'Transit' and distance is large (>75 percentile)

In [87]:
planets_= planets.copy()
distance_percentile75= planets_.distance.quantile(0.75)
for i, r in planets_.iterrows():
  if planets_.loc[i, 'year']< 2010:
    planets_.drop(i, inplace=True)
    continue
  if (planets_.loc[i, 'method'] != 'Radial Velocity') and  (planets_.loc[i, 'method'] != 'Transit'):
    planets_.drop(i, inplace=True)
    continue
  if (planets_.loc[i, 'distance']) < distance_percentile75:
    planets_.drop(i, inplace=True)
    continue

In [88]:

planets_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [89]:
planets2_= planets.copy()
distance_percentile75

59.3325

Indexing using Query

In [90]:
planets2_= planets2_[
            (planets2_['year']>=2010) & 
            ((planets2_['method'] == 'Radial Velocity') | (planets2_['method'] == 'Transit')) &
            (planets2_['distance']> distance_percentile75)
]

In [91]:
planets2_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

#Manipulating a database 

Modify each row in the method column to have only the abbreviation of each method

In [92]:
planets.method.unique() #Original Dataset

array(['Radial Velocity', 'Transit'], dtype=object)

In [93]:
planets2_.method.unique() #Filtered Dataset

array(['Radial Velocity', 'Transit'], dtype=object)

In [94]:
s= 'Radial Velocity'
''.join(x[0] for x in s.split())

'RV'

In [95]:
short_names={}
for s in planets.method.unique():
  short_names[s]= ''.join(x[0] for x in s.split())
short_names

{'Radial Velocity': 'RV', 'Transit': 'T'}

In [96]:
planets_new= planets.copy()
for i, r in planets_new.iterrows():
  planets_new.loc[i, 'method_new']= short_names[r['method']]

#shortnames.get(r['method'], r['method']) ---> Alternative way of assigning the values by matching keys from the method column

In [97]:
planets_new

              method  number  orbital_period    mass  distance  year method_new
0    Radial Velocity       1       269.30000   7.100     77.40  2006         RV
1    Radial Velocity       1       874.77400   2.210     56.95  2008         RV
2    Radial Velocity       1       763.00000   2.600     19.84  2011         RV
3    Radial Velocity       1       326.03000  19.400    110.62  2007         RV
4    Radial Velocity       1       516.22000  10.500    119.47  2009         RV
..               ...     ...             ...     ...       ...   ...        ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009         RV
641  Radial Velocity       1         5.05050   1.068     44.46  2013         RV
642  Radial Velocity       1       311.28800   1.940     17.24  1999         RV
649          Transit       1         2.70339   1.470    178.00  2013          T
784  Radial Velocity       3       580.00000   0.947    135.00  2012         RV

[498 rows x 7 columns]

In [98]:
planets_reloaded= sns.load_dataset('planets')
def shorten_methods(s):
  return short_names.get(s,s)

planets_reloaded['short methods']= planets_reloaded['method'].apply(shorten_methods)

In [99]:
planets_reloaded

               method  number  orbital_period  ...  distance  year  short methods
0     Radial Velocity       1      269.300000  ...     77.40  2006             RV
1     Radial Velocity       1      874.774000  ...     56.95  2008             RV
2     Radial Velocity       1      763.000000  ...     19.84  2011             RV
3     Radial Velocity       1      326.030000  ...    110.62  2007             RV
4     Radial Velocity       1      516.220000  ...    119.47  2009             RV
...               ...     ...             ...  ...       ...   ...            ...
1030          Transit       1        3.941507  ...    172.00  2006              T
1031          Transit       1        2.615864  ...    148.00  2007              T
1032          Transit       1        3.191524  ...    174.00  2007              T
1033          Transit       1        4.125083  ...    293.00  2008              T
1034          Transit       1        4.187757  ...    260.00  2008              T

[1035 rows x 7 columns]

#Trying some analysis with these methods

Count the number of planets with each method type

1. **Split** the dataframe into smaller chunks (in this case they should have the same method)
2. **Apply** some function in each smaller chunk ( in this case the count function)
3. **Aggregate** the results from each chunk together

In [100]:
planets_reloaded[planets_reloaded['method']== 'Radial Velocity']['method'].count()

553

In [101]:
count={}
for m in planets_reloaded.method.unique():
  count[m]=planets_reloaded[planets_reloaded['method'] == m]['method'].count()
print(count)

{'Radial Velocity': 553, 'Imaging': 38, 'Eclipse Timing Variations': 9, 'Transit': 397, 'Astrometry': 2, 'Transit Timing Variations': 4, 'Orbital Brightness Modulation': 3, 'Microlensing': 23, 'Pulsar Timing': 5, 'Pulsation Timing Variations': 1}

In [102]:
#Alternative 
planets_reloaded.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

In [103]:
planets_reloaded.groupby('method')['distance'].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

Find out what fraction of the planets have been found in the last decaded (i.e 2010s) across each method type

1. Filtering operation
2. Split.
3. Apply
4. Aggregate

In [104]:
planets_reloaded[planets_reloaded['year']>=2010]

               method  number  orbital_period  ...  distance  year  short methods
2     Radial Velocity       1      763.000000  ...     19.84  2011             RV
9     Radial Velocity       2      452.800000  ...     74.79  2010             RV
10    Radial Velocity       2      883.000000  ...     74.79  2010             RV
20    Radial Velocity       5        0.736540  ...     12.53  2011             RV
26    Radial Velocity       1      691.900000  ...     81.50  2012             RV
...               ...     ...             ...  ...       ...   ...            ...
1025          Transit       1        3.067850  ...     60.00  2012              T
1026          Transit       1        0.925542  ...    470.00  2014              T
1027          Imaging       1             NaN  ...     19.20  2011        Imaging
1028          Transit       1        3.352057  ...   3200.00  2012              T
1029          Imaging       1             NaN  ...     10.10  2012        Imaging

[597 rows x 7 columns]

In [105]:
#planets_reloaded[planets_reloaded['year']>=2010]

In [106]:
s_2010s= planets_reloaded[planets_reloaded['year']>=2010].groupby('method')['method'].count()  #With Filter

In [107]:
s_AllTime= planets_reloaded.groupby('method')['method'].count() #Without Filter

In [108]:
s_2010s/s_AllTime

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

In [109]:
nifty50_2018= pd.read_csv('NIFTY50_2018.csv')

In [110]:
nifty50_2018.head()

          Date      Open      High       Low     Close
0  31 Dec 2018  10913.20  10923.55  10853.20  10862.55
1  28 Dec 2018  10820.95  10893.60  10817.15  10859.90
2  27 Dec 2018  10817.90  10834.20  10764.45  10779.80
3  26 Dec 2018  10635.45  10747.50  10534.55  10729.85
4  24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [111]:
nifty50_2018= pd.read_csv('NIFTY50_2018.csv', index_col=0) #Assigning the date the index column

In [112]:
nifty50_2018.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [113]:
nifty50_2019= pd.read_csv('NIFTY50_2019.csv', index_col=0)
nifty50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [114]:
nifty_50= pd.concat([nifty50_2018, nifty50_2019])

In [115]:
#pd.merge(left= nifty50_2018, right=nifty50_2019, how= 'outer', on= 'Date') Alternative

In [116]:
niftynext50_2019= pd.read_csv('NIFTYNext50_2019.csv', index_col=0)
niftynext50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  28495.00  28549.50  28270.25  28307.55
30 Dec 2019  28528.95  28612.95  28406.70  28484.85
27 Dec 2019  28354.50  28500.25  28319.90  28476.80
26 Dec 2019  28409.10  28435.25  28259.75  28280.25
24 Dec 2019  28423.70  28430.40  28318.75  28382.85

In [117]:
nifty_2019= pd.concat([nifty50_2019, niftynext50_2019], axis=1) #Concatenating breadthwise
nifty_2019

                 Open      High       Low  ...      High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...  28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...  28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...  28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...  28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...  28430.40  28318.75  28382.85
...               ...       ...       ...  ...       ...       ...       ...
07 Jan 2019  10804.85  10835.95  10750.15  ...  27932.00  27652.95  27706.60
04 Jan 2019  10699.70  10741.05  10628.65  ...  27842.75  27533.90  27719.50
03 Jan 2019  10796.80  10814.05  10661.25  ...  28045.30  27630.20  27674.65
02 Jan 2019  10868.85  10895.35  10735.05  ...  28188.40  27801.75  27876.95
01 Jan 2019  10881.70  10923.60  10807.10  ...  28252.20  27988.60  28111.65

[245 rows x 8 columns]

In [118]:
#Hierarchial Indexing
nifty_2019= pd.concat([nifty50_2019, niftynext50_2019], axis=1, keys=['nifty50', 'niftynext50']) #Concatenating breadthwise
nifty_2019

              nifty50                      ... niftynext50
                 Open      High       Low  ...        High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...    28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...    28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...    28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...    28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...    28430.40  28318.75  28382.85
...               ...       ...       ...  ...         ...       ...       ...
07 Jan 2019  10804.85  10835.95  10750.15  ...    27932.00  27652.95  27706.60
04 Jan 2019  10699.70  10741.05  10628.65  ...    27842.75  27533.90  27719.50
03 Jan 2019  10796.80  10814.05  10661.25  ...    28045.30  27630.20  27674.65
02 Jan 2019  10868.85  10895.35  10735.05  ...    28188.40  27801.75  27876.95
01 Jan 2019  10881.70  10923.60  10807.10  ...    28252.20  27988.60  28111.65

[245 rows x 8 columns]

In [119]:
nifty_2019['nifty50'] #First half slice based on top level index

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55
...               ...       ...       ...       ...
07 Jan 2019  10804.85  10835.95  10750.15  10771.80
04 Jan 2019  10699.70  10741.05  10628.65  10727.35
03 Jan 2019  10796.80  10814.05  10661.25  10672.25
02 Jan 2019  10868.85  10895.35  10735.05  10792.50
01 Jan 2019  10881.70  10923.60  10807.10  10910.10

[245 rows x 4 columns]

In [120]:
nifty_2019['nifty50']['Open']

Date
31 Dec 2019    12247.10
30 Dec 2019    12274.90
27 Dec 2019    12172.90
26 Dec 2019    12211.85
24 Dec 2019    12269.25
                 ...
07 Jan 2019    10804.85
04 Jan 2019    10699.70
03 Jan 2019    10796.80
02 Jan 2019    10868.85
01 Jan 2019    10881.70
Name: Open, Length: 245, dtype: float64

#Tasks

In 2019, how many days was NIFTY50 volatile (high> 105% of low)

In [121]:
nifty50_2019[nifty50_2019['High']> 1.05*nifty50_2019['Low']].shape[0]

1

Same thing but for NIFTY50NEXT

In [122]:
niftynext50_2019[niftynext50_2019['High']> 1.05*niftynext50_2019['Low']].shape[0]

1

# Compute mean, median, std, variance of closing values for each weekday in NIFTY50 for 2019

In [123]:
new_index_nifty50_2019= map(pd.Timestamp, nifty50_2019.index)
nifty50_2019_newindex= pd.DataFrame(nifty50_2019, index=new_index_nifty50_2019)

In [124]:
nifty50_2019_newindex

                Open      High       Low     Close
2019-12-31  12247.10  12247.10  12151.80  12168.45
2019-12-30  12274.90  12286.45  12213.80  12255.85
2019-12-27  12172.90  12258.45  12157.90  12245.80
2019-12-26  12211.85  12221.55  12118.85  12126.55
2019-12-24  12269.25  12283.70  12202.10  12214.55
...              ...       ...       ...       ...
2019-01-07  10804.85  10835.95  10750.15  10771.80
2019-01-04  10699.70  10741.05  10628.65  10727.35
2019-01-03  10796.80  10814.05  10661.25  10672.25
2019-01-02  10868.85  10895.35  10735.05  10792.50
2019-01-01  10881.70  10923.60  10807.10  10910.10

[245 rows x 4 columns]

In [125]:
nifty50_2019_newindex['Day of Week']= nifty50_2019_newindex.index.dayofweek
nifty50_2019_newindex

                Open      High       Low     Close  Day of Week
2019-12-31  12247.10  12247.10  12151.80  12168.45            1
2019-12-30  12274.90  12286.45  12213.80  12255.85            0
2019-12-27  12172.90  12258.45  12157.90  12245.80            4
2019-12-26  12211.85  12221.55  12118.85  12126.55            3
2019-12-24  12269.25  12283.70  12202.10  12214.55            1
...              ...       ...       ...       ...          ...
2019-01-07  10804.85  10835.95  10750.15  10771.80            0
2019-01-04  10699.70  10741.05  10628.65  10727.35            4
2019-01-03  10796.80  10814.05  10661.25  10672.25            3
2019-01-02  10868.85  10895.35  10735.05  10792.50            2
2019-01-01  10881.70  10923.60  10807.10  10910.10            1

[245 rows x 5 columns]

In [162]:
nifty50_2019_newindex.groupby('Day of Week')['Close'].mean()

Day of Week
0    11463.535870
1    11444.318000
2    11385.222340
3    11430.373000
4    11435.394118
6    11627.150000
Name: Close, dtype: float64

In [163]:
nifty50_2019_newindex.groupby('Day of Week')['Close'].median()

Day of Week
0    11573.475
1    11544.150
2    11440.200
3    11576.900
4    11456.900
6    11627.150
Name: Close, dtype: float64

In [164]:
nifty50_2019_newindex.groupby('Day of Week')['Close'].std()

Day of Week
0    463.019749
1    462.829541
2    449.850387
3    470.461726
4    443.779665
6           NaN
Name: Close, dtype: float64

In [165]:
nifty50_2019_newindex.groupby('Day of Week')['Close'].var()

Day of Week
0    214387.288296
1    214211.183649
2    202365.370740
3    221334.235430
4    196940.391065
6              NaN
Name: Close, dtype: float64

# Compute mean, median, std, var for each month

In [166]:
nifty50_2019_newindex['Month Of Year']= nifty50_2019_newindex.index.month
nifty50_2019_newindex

                Open      High       Low     Close  Day of Week  Month Of Year
2019-12-31  12247.10  12247.10  12151.80  12168.45            1             12
2019-12-30  12274.90  12286.45  12213.80  12255.85            0             12
2019-12-27  12172.90  12258.45  12157.90  12245.80            4             12
2019-12-26  12211.85  12221.55  12118.85  12126.55            3             12
2019-12-24  12269.25  12283.70  12202.10  12214.55            1             12
...              ...       ...       ...       ...          ...            ...
2019-01-07  10804.85  10835.95  10750.15  10771.80            0              1
2019-01-04  10699.70  10741.05  10628.65  10727.35            4              1
2019-01-03  10796.80  10814.05  10661.25  10672.25            3              1
2019-01-02  10868.85  10895.35  10735.05  10792.50            2              1
2019-01-01  10881.70  10923.60  10807.10  10910.10            1              1

[245 rows x 6 columns]

In [167]:
nifty50_2019_newindex.groupby('Month Of Year')['Close'].mean()

Month Of Year
1     10809.463043
2     10833.840000
3     11317.242105
4     11666.452632
5     11592.022727
6     11839.023684
7     11523.110870
8     10976.500000
9     11124.289474
10    11490.205000
11    11964.132500
12    12096.880952
Name: Close, dtype: float64